ipupiara/tempix/tempix-03/ST/BSP/STM32F756ZG_Nucleo/bsp_clk.c
/*
*********************************************************************************************************
*                                            EXAMPLE CODE
*
*               This file is provided as an example on how to use Micrium products.
*
*               Please feel free to use any application code labeled as 'EXAMPLE CODE' in
*               your application products.  Example code may be used as is, in whole or in
*               part, or may be used as a reference only. This file can be modified as
*               required to meet the end-product requirements.
*
*               Please help us continue to provide the Embedded community with the finest
*               software available.  Your honesty is greatly appreciated.
*
*               You can find our product's user manual, API reference, release notes and
*               more information at https://doc.micrium.com.
*               You can contact us at www.micrium.com.
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                    MICRIUM BOARD SUPPORT PACKAGE
*                                         STM32F767ZI NUCLEO
*
* Filename : bsp_clk.c
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                            INCLUDE FILES
*********************************************************************************************************
*/

#include  <lib_def.h>
#include  "bsp_clk.h"

#ifdef  CLK_MODULE_PRESENT
#include  <Source/clk.h>
#include  <clk_cfg.h>
#endif

#include  <stm32f7xx_hal.h>


/*
*********************************************************************************************************
*                                            LOCAL DEFINES
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                      LOCAL FUNCTION PROTOTYPES
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*********************************************************************************************************
*                                          GLOBAL FUNCTIONS
*********************************************************************************************************
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                            BSP_ClkInit()
*
* Description : Initializes the system clock for the kernel.
*
* Argument(s) : none.
*
* Return(s)   : none.
*
* Note(s)     : (1) Should be called before OSStart() in main.
*
*               (2) The following formulas indicate the frequencies fed to the various clocks:
*
*                   f(VCO clock) = f(PLL clock input) * (PLLN/PLLM) = 8 MHz * (432/8) = 432 MHz
*
*                   f(PLL general clock output) = f(VCO clock) / PLLP = 432 MHz / 2 = 216 MHz
*
*                   f(USB OTG FS, SDMMC1/2, RNG clock output) = f(VCO clock) / PLLQ = 432 MHz / 9 = 48 MHz
*
*                   f(PLL DSI clock output) = f(VCO clock) / PLLR = 432 MHz / 7 = 61.71 MHz
*********************************************************************************************************
*/

void  BSP_ClkInit (void)
{
    RCC_ClkInitTypeDef  RCC_ClkInit;
    RCC_OscInitTypeDef  RCC_OscInit;
    HAL_StatusTypeDef   hal_status;
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

    /** Configure the main internal regulator output voltage
    */
    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);  //  copied from ioc generator code

#ifdef useHSEclock                                                               /* Enable HSE Osc and activate PLL with HSE as source   */
    RCC_OscInit.OscillatorType = RCC_OSCILLATORTYPE_HSE;        /* HSE = 8 MHz                                          */
    RCC_OscInit.HSEState       = RCC_HSE_BYPASS;
    RCC_OscInit.HSIState       = RCC_HSI_OFF;
    RCC_OscInit.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInit.PLL.PLLSource  = RCC_PLLSOURCE_HSE;

    RCC_OscInit.PLL.PLLM = 4u;                                  /* See Note (2)                                         */
    RCC_OscInit.PLL.PLLN = 216u;
    RCC_OscInit.PLL.PLLP = RCC_PLLP_DIV2;
    RCC_OscInit.PLL.PLLQ = 2u;
 //   RCC_OscInit.PLL.PLLR = 7u;
#else
  #ifdef useHSIclock
     RCC_OscInit.OscillatorType = RCC_OSCILLATORTYPE_HSI;
     RCC_OscInit.HSIState = RCC_HSI_ON;
     RCC_OscInit.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
     RCC_OscInit.PLL.PLLState = RCC_PLL_ON;
     RCC_OscInit.PLL.PLLSource = RCC_PLLSOURCE_HSI;
     RCC_OscInit.PLL.PLLM = 8;
     RCC_OscInit.PLL.PLLN = 216;
     RCC_OscInit.PLL.PLLP = RCC_PLLP_DIV2;
     RCC_OscInit.PLL.PLLQ = 2;
  #endif
#endif

    if (HAL_RCC_OscConfig(&RCC_OscInit) != HAL_OK) {
        while(1u);                                              /* STOP if error                                        */
    }

    hal_status = HAL_PWREx_EnableOverDrive();                   /* Activate the OverDrive to reach the 216 MHz Freq     */
    if (hal_status != HAL_OK) {
        while (DEF_TRUE) {                                      /* STOP if error                                        */
            ;
        }
    }

                                                                /* ----- CFG SYSCLK SOURCE AND BUS CLOCK DIVIDERS ----- */
    RCC_ClkInit.ClockType      = (RCC_CLOCKTYPE_SYSCLK   |
                                  RCC_CLOCKTYPE_HCLK     |
                                  RCC_CLOCKTYPE_PCLK1    |
                                  RCC_CLOCKTYPE_PCLK2);

    RCC_ClkInit.SYSCLKSource   =  RCC_SYSCLKSOURCE_PLLCLK;      /* Select PLL as system clock source                    */
    RCC_ClkInit.AHBCLKDivider  =  RCC_SYSCLK_DIV1;              /* HCLK    = AHBxCLK = SYSCLK / AHBPRES(1) = 216 MHz    */
    RCC_ClkInit.APB1CLKDivider =  RCC_HCLK_DIV4;                /* APB1CLK = AHB1CLK / APB1DIV(4)          =  54 MHz    */
    RCC_ClkInit.APB2CLKDivider =  RCC_HCLK_DIV2;                /* APB2CLK = AHB2CLK / APB2DIV(2)          = 108 MHz    */

